worker(1, семенов, директор, 20000, 123).
worker(2, купцов, заместитель_директора, 18000, 123).
worker(3, корягин, начальник_отдела, 15000, 345).
worker(4, мясников, работник, 10000, 345).
worker(5, рожков, начальник_отдела, 15000, 456).
worker(6, нетиевский, работник, 10000, 456).
worker(7, михалкова, работник, 10000, 456).
worker(8, воротникова, начальник_отдела, 15000, 567).
worker(9, аманкулов, работник, 10000, 567).

rel(1, семенова, 3).
rel(3, корягина, 2).
rel(6, нетиевская, 5).
rel(7, исаев, 0).
rel(9, аманкулова, 1).

familiar(A, B) :- worker(_, A, _, _, X), worker(_, B, _, _, X).
familiar_rel(A,B) :- worker(X, A, _, _, Y), worker(Z, B, _, _, Y), rel(X, _, _), rel(Z, _, _).

otdel(X) :- worker(Y, Z, B, A, X), write((Y, Z, B, A, X)).
wages(X) :- worker(Y, Z, B, A, D), A > X, write((Y, Z, B, A, D)).
kids(X) :- worker(A, B, C, D, E), rel(A, F, G), G > X, write((A, B, C, D, E)).
